app/controllers/access_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `roles`.* FROM `roles` INNER JOIN `roles_users` ON `roles`.`id` = `roles_users`.`role_id` WHERE `roles_users`.`user_id` = 2
SELECT COUNT(*) FROM `permissions` INNER JOIN `permissions_roles` ON `permissions`.`id` = `permissions_roles`.`permission_id` WHERE `permissions_roles`.`role_id` = 2 AND `permissions`.`name` = 'create_doctor'
---
  def menu
   idd=session[:user_id]
   @user=User.where(id: idd).first
   @role=@user.roles
   @flag1=@flag2=@flag3=@flag4=@flag5=0
   @role.each do |role|
      if !(role.permissions.where(:name => 'create_doctor').empty?)

SELECT `users`.* FROM `users` WHERE `users`.`username` = 'aka_007' ORDER BY `users`.`id` ASC LIMIT 1
---
  def attempt_login
    authorized_user=User.authenticate(params[:name], params[:password])
    if authorized_user
      x=User.where(username: params[:name]).first