app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT `users`.* FROM `users`

  def search_doctor
    cnt=0
    @search=[]
    @doctor=Doctor.all
---
SELECT `doctors`.* FROM `doctors`

    def set_user
      @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1